## CROSS RIVER ASSESSMENT

In [1]:
import pandas as pd
import numpy as np

In [2]:
path = r'C:\Users\Sonit Samal\Desktop\Cross River Assessment\loan.csv'
df_loan_data = pd.read_csv(path)

C:\Users\Sonit Samal\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (19,55) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
df_loan_data.head(5)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m
0,1077501,1296599,5000.0,5000.0,4975.0,36 months,10.65,162.87,B,B2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1077430,1314167,2500.0,2500.0,2500.0,60 months,15.27,59.83,C,C4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1077175,1313524,2400.0,2400.0,2400.0,36 months,15.96,84.33,C,C5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1076863,1277178,10000.0,10000.0,10000.0,36 months,13.49,339.31,C,C1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1075358,1311748,3000.0,3000.0,3000.0,60 months,12.69,67.79,B,B5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Data Cleaning

#### 1. Listing names of all the columns

In [5]:
list(df_loan_data.columns.values)

['id',
 'member_id',
 'loan_amnt',
 'funded_amnt',
 'funded_amnt_inv',
 'term',
 'int_rate',
 'installment',
 'grade',
 'sub_grade',
 'emp_title',
 'emp_length',
 'home_ownership',
 'annual_inc',
 'verification_status',
 'issue_d',
 'loan_status',
 'pymnt_plan',
 'url',
 'desc',
 'purpose',
 'title',
 'zip_code',
 'addr_state',
 'dti',
 'delinq_2yrs',
 'earliest_cr_line',
 'inq_last_6mths',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'open_acc',
 'pub_rec',
 'revol_bal',
 'revol_util',
 'total_acc',
 'initial_list_status',
 'out_prncp',
 'out_prncp_inv',
 'total_pymnt',
 'total_pymnt_inv',
 'total_rec_prncp',
 'total_rec_int',
 'total_rec_late_fee',
 'recoveries',
 'collection_recovery_fee',
 'last_pymnt_d',
 'last_pymnt_amnt',
 'next_pymnt_d',
 'last_credit_pull_d',
 'collections_12_mths_ex_med',
 'mths_since_last_major_derog',
 'policy_code',
 'application_type',
 'annual_inc_joint',
 'dti_joint',
 'verification_status_joint',
 'acc_now_delinq',
 'tot_coll_amt',
 'tot_cur_bal',
 'open_acc_6m',
 'open_il_6m',
 'open_il_12m',
 'open_il_24m',
 'mths_since_rcnt_il',
 'total_bal_il',
 'il_util',
 'open_rv_12m',
 'open_rv_24m',
 'max_bal_bc',
 'all_util',
 'total_rev_hi_lim',
 'inq_fi',
 'total_cu_tl',
 'inq_last_12m']

#### 2. List All the Columns that have NaN values

In [7]:
df_loan_data.columns[df_loan_data.isnull().any()].tolist()

['emp_title',
 'annual_inc',
 'desc',
 'title',
 'delinq_2yrs',
 'earliest_cr_line',
 'inq_last_6mths',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'open_acc',
 'pub_rec',
 'revol_util',
 'total_acc',
 'last_pymnt_d',
 'next_pymnt_d',
 'last_credit_pull_d',
 'collections_12_mths_ex_med',
 'mths_since_last_major_derog',
 'annual_inc_joint',
 'dti_joint',
 'verification_status_joint',
 'acc_now_delinq',
 'tot_coll_amt',
 'tot_cur_bal',
 'open_acc_6m',
 'open_il_6m',
 'open_il_12m',
 'open_il_24m',
 'mths_since_rcnt_il',
 'total_bal_il',
 'il_util',
 'open_rv_12m',
 'open_rv_24m',
 'max_bal_bc',
 'all_util',
 'total_rev_hi_lim',
 'inq_fi',
 'total_cu_tl',
 'inq_last_12m']

#### 3. Slice the Dataframe to get certain columns

In [8]:
df_loan_data[['loan_amnt','last_pymnt_d']].head(5)

   loan_amnt last_pymnt_d
0     5000.0     Jan-2015
1     2500.0     Apr-2013
2     2400.0     Jun-2014
3    10000.0     Jan-2015
4     3000.0     Jan-2016

In [9]:
df_loan_data[['funded_amnt','last_pymnt_d']].head(5)

   funded_amnt last_pymnt_d
0       5000.0     Jan-2015
1       2500.0     Apr-2013
2       2400.0     Jun-2014
3      10000.0     Jan-2015
4       3000.0     Jan-2016

#### 4. Splitting Last Payment Date Column by ' - ' to get Month

In [16]:
df_loan_data['Month'] = df_loan_data['last_pymnt_d'].str.split('-').str[0]
df_loan_data['Month'].head(5)

0    Jan
1    Apr
2    Jun
3    Jan
4    Jan
Name: Month, dtype: object

#### 5. Splitting Last Payment Date Column by ' - ' to get Year

In [17]:
df_loan_data['Year'] = df_loan_data['last_pymnt_d'].str.split('-').str[1]
df_loan_data['Year'].head(5)

0    2015
1    2013
2    2014
3    2015
4    2016
Name: Year, dtype: object

#### 6. Get Unique Elements in of a 'Month' Column

In [21]:
len(df_loan_data.Month.unique())

13

In [22]:
df_loan_data.Month.unique()

array(['Jan', 'Apr', 'Jun', 'Nov', 'Sep', 'Jul', 'Oct', 'May', 'Feb',
       'Aug', nan, 'Dec', 'Mar'], dtype=object)

#### It shows the existence of a NaN value in the Months columns, so those rows have to be discarded

In [24]:
df_loan_amnt = df_loan_data[['loan_amnt','Month','Year']].dropna(how='any',axis=0)
df_loan_amnt.head(5)

   loan_amnt Month  Year
0     5000.0   Jan  2015
1     2500.0   Apr  2013
2     2400.0   Jun  2014
3    10000.0   Jan  2015
4     3000.0   Jan  2016

#### Similarly removing NaN values for all the other fund amounts

In [26]:
df_fund_amnt = df_loan_data[['funded_amnt','Month','Year']].dropna(how='any',axis=0)
df_fund_amnt.head(5)

   funded_amnt Month  Year
0       5000.0   Jan  2015
1       2500.0   Apr  2013
2       2400.0   Jun  2014
3      10000.0   Jan  2015
4       3000.0   Jan  2016

In [32]:
df_fund_amnt_inv = df_loan_data[['funded_amnt_inv','Month','Year']].dropna(how='any',axis=0)
df_fund_amnt_inv.head(5)

   funded_amnt_inv Month  Year
0           4975.0   Jan  2015
1           2500.0   Apr  2013
2           2400.0   Jun  2014
3          10000.0   Jan  2015
4           3000.0   Jan  2016

### Aggregating results for Loan amount, Fund amount and Investor fund amount by the year

In [123]:
df_loan_amnt.loc[df_loan_amnt['Year'] == '2011', 'loan_amnt'].sum()

57857825.0

In [124]:
df_fund_amnt.loc[df_fund_amnt['Year'] == '2011', 'funded_amnt'].sum()

56158025.0

In [125]:
df_fund_amnt_inv.loc[df_fund_amnt_inv['Year'] == '2011', 'funded_amnt_inv'].sum()

47556195.38638998

### Plotting of Monthly Loan Volume

In [35]:
import matplotlib.pyplot as plt

In [40]:
list_months = ['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']

In [60]:
df_graph2 = df_loan_amnt.loc[df_loan_amnt['Year'] == '2013'].groupby('Month',as_index=False)['loan_amnt'].sum()
df_graph2

   Month   loan_amnt
0    Apr  23528025.0
1    Aug  32850600.0
2    Dec  39520800.0
3    Feb  19326050.0
4    Jan  18132775.0
5    Jul  30730425.0
6    Jun  24700500.0
7    Mar  25043450.0
8    May  27198700.0
9    Nov  35058250.0
10   Oct  37177550.0
11   Sep  32036025.0

In [99]:
MonthlyLoanVolume = {}
for month in list_months:
    MonthlyLoanVolume[month] = int(df_graph2.loc[df_graph2.Month == month,'loan_amnt'].iloc[0])

list1 = MonthlyLoanVolume.keys()
list2 = MonthlyLoanVolume.values()

print(list1)
print(list2)

dict_keys(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])
dict_values([18132775, 19326050, 25043450, 23528025, 27198700, 24700500, 30730425, 32850600, 32036025, 37177550, 35058250, 39520800])

### Plotting Monthly Loan by Credit Grade data

In [65]:
df_loan_amnt_grade = df_loan_data[['loan_amnt','Month','Year','grade']].dropna(how='any',axis=0)
df_loan_amnt_grade.head(10)

   loan_amnt Month  Year grade
0     5000.0   Jan  2015     B
1     2500.0   Apr  2013     C
2     2400.0   Jun  2014     C
3    10000.0   Jan  2015     C
4     3000.0   Jan  2016     B
5     5000.0   Jan  2015     A
6     7000.0   Jan  2016     C
7     3000.0   Jan  2015     E
8     5600.0   Apr  2012     F
9     5375.0   Nov  2012     B

In [93]:
list_grade = sorted(df_loan_amnt_grade['grade'].unique())

In [88]:
df_loan_amnt_grade['loan_amnt'][(df_loan_amnt_grade['Year'] == '2012') & (df_loan_amnt_grade['Month'] == 'Jan') & (df_loan_amnt_grade['grade'] == 'A')].mean()

7569.186046511628

In [97]:
LoanByCreditGrade = {}
for grade in list_grade:
    LoanByCreditGrade[grade] = {'x':list_months,'y':[]}
    for month in list_months:
        LoanByCreditGrade[grade]['y'].append(int(df_loan_amnt_grade['loan_amnt'][(df_loan_amnt_grade['Year'] == '2012') & (df_loan_amnt_grade['Month'] == month) & (df_loan_amnt_grade['grade'] == grade)].mean()))

LoanByCreditGrade

{'A': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [7569,
   8074,
   7549,
   8854,
   8367,
   8385,
   8610,
   8430,
   8591,
   9117,
   8343,
   9085]},
 'B': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [10088,
   10762,
   10642,
   11817,
   11484,
   10497,
   11262,
   11494,
   11459,
   11100,
   10731,
   11947]},
 'C': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [9758,
   10744,
   10568,
   10672,
   11118,
   11372,
   10781,
   10849,
   11487,
   11130,
   10845,
   12294]},
 'D': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [12411,
   10770,
   11496,
   10748,
   13796,
   11950,
   11515,
   12207,
   12044,
   13764,
   13935,
   14819]},
 'E': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [13464,
   13521,
   14322,
   15391,
   15676,
   15817,
   16061,
   18364,
   17074,
   16799,
   17071,
   16385]},
 'F': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [17444,
   17608,
   13344,
   18745,
   21036,
   20547,
   17085,
   19645,
   19249,
   20013,
   18740,
   21280]},
 'G': {'x': ['Jan',
   'Feb',
   'Mar',
   'Apr',
   'May',
   'Jun',
   'Jul',
   'Aug',
   'Sep',
   'Oct',
   'Nov',
   'Dec'],
  'y': [14420,
   19443,
   18345,
   16463,
   16701,
   19500,
   18368,
   22228,
   22971,
   26662,
   18237,
   21062]}}